# ln
为文件建立链接关系。

### 硬链接
硬链接指通过索引节点来进行连接。在Linux的文件系统中，保存在磁盘分区中的文件不管是什么类型都给它分配一个编号，称为索引节点号(inode)。在Linux中，多个文件名指向同一索引节点是存在的。一般这种连接就是硬连接。硬连接的作用是允许一个文件拥有多个有效路径名，这样用户就可以建立硬连接到重要文件，以防止“误删”的功能。其原因如上所述，因为对应该目录的索引节点有一个以上的连接。只删除一个连接并不影响索引节点本身和其它的连接，只有当最后一个连接被删除后，文件的数据块及目录的连接才会被释放。也就是说，文件真正删除的条件是与之相关的所有硬连接文件均被删除。

硬连接有2个限制：(1)不允许给目录创建硬链接。(2)只有在同一文件系统中的文件之间才能创建链接。即不同硬盘分区上的两个文件之间不能够建立硬链接。这是因为硬链接是通过结点指向原始文件的，而文件的inode在不同的文件系统中可能会不同。

### 软链接
另外一种链接称之为符号链接，也叫软链接。软链接文件有类似于Windows的快捷方式。它实际上是一个特殊的文件。在符号链接中，文件实际上是一个文本文件，其中包含的有另一文件的位置信息。这就允许符号链接指向位于其他分区、甚至是其他网络硬盘上的某个文件。

## 语法
`ln [options] <source> <dest>`

创建一个从dest到source的链接。

## 参数

- `-b` 将在链接时会被覆写或删除的文件进行备份

- `-d` 允许系统管理者硬链结目录

- `-f` 链接时先将与dest同名的文件删除

- `-i` 在删除与dest同名的文件时先进行询问

- `-n` 在进行软链接时，将 dest 视为普通文件

- `-s` 进行软链接，默认情况下进行硬链接

- `-v` 在链接之前显示文件名

- `-S <SUFFIX>` 将备份的档案都加上\<SUFFIX\>的字尾

- `-V <METHOD>` 指定备份的方式

- `--help` 显示帮助说明

- `--version` 显示版本
